Autodesk.Revit.UI.Selection.SelectableInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements.
document:
The document that owns the view.
viewId:
The view id.
inverted:
True if the filter should match all elements not selectable in the given view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.Selection.SelectableInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of an SelectableInViewFilter.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.Selection.SelectableInViewFilter
A filter that passes elements that are selectable in the given view.
Remarks:
This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
This filter is designed to operate on a list of elements visible in the given view.
This can be obtained from a FilteredElementCollector constructed with the view id.
This filter may not correctly restrict elements which are not a part of the visible elements of the view.
Since:
2015